src/main/java/br/com/infotera/it/tboholiday/newXMLDocument.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
    <soap:Header>
        <Credentials xmlns="http://TekTravel/HotelBookingApi" UserName="InfoteraTest" Password="Inf@64890970"/>
    </soap:Header>
    <soap:Body>
        <HotelRoomAvailabilityRequest xmlns="http://TekTravel/HotelBookingApi">
            <SessionId>4b441352-4835-4fd4-81e5-eea0bc211507</SessionId>
            <ResultIndex>1</ResultIndex>
            <HotelCode>1246485</HotelCode>
            <ResponseTime>30</ResponseTime>
            <IsCancellationPolicyRequired>true</IsCancellationPolicyRequired>
        </HotelRoomAvailabilityRequest>
    </soap:Body>
</soap:Envelope>
